--- src/main.rs
+++ replace main with ()
@@ -1,16 +1,6 @@
 // Point d'entrée principal temporaire
 // Sera remplacé par la structure modulaire dans les prochaines versions
 
 fn main() {
-    println!("Miaou v{}", env!("CARGO_PKG_VERSION"));
-    println!("Communication décentralisée");
-    
-    #[cfg(target_os = "android")]
-    println!("Support Android activé");
-    
-    #[cfg(target_os = "ios")]
-    println!("Support iOS activé");
-    
-    #[cfg(not(any(target_os = "android", target_os = "ios")))]
-    println!("Version desktop");
+    () /* ~ changed by cargo-mutants ~ */
 }
